{"meta":{"title":"UncleMask`s Laboratory","subtitle":"Just Do What You Want","description":"这里面什么都有，就是没有有用的东西","author":"UncleMask","url":"http://yoursite.com"},"pages":[{"title":"关于","date":"2018-01-15T04:53:41.000Z","updated":"2018-01-20T11:01:03.866Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"这里是一条化学🐶+程序🐒的博客。在这个社会里拥有梦想真的是一件非常奢侈的事情。"},{"title":"统计","date":"2018-01-15T07:11:26.506Z","updated":"2018-01-15T07:11:26.506Z","comments":true,"path":"archive/index.html","permalink":"http://yoursite.com/archive/index.html","excerpt":"","text":""},{"title":"categories","date":"2015-10-19T22:49:50.000Z","updated":"2018-01-15T06:44:34.949Z","comments":false,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"重结晶基础操作","slug":"18-1-20-CJJ","date":"2018-01-20T10:24:06.000Z","updated":"2018-01-20T10:54:45.911Z","comments":true,"path":"2018/01/20/18-1-20-CJJ/","link":"","permalink":"http://yoursite.com/2018/01/20/18-1-20-CJJ/","excerpt":"","text":"原理利用混合物中各组分在某种溶剂中的溶解度不同，或者在同一溶剂中不同温度时的溶解度不同，而使它们相互分离。 溶剂的选择我们从下面七个方面来选择溶剂： 常用溶剂： DMF、氯苯、二甲苯、甲苯、乙腈、乙醇、THF、氯仿、乙酸乙酯、环己烷、丁酮、丙酮、石油醚。 比较常用溶剂：DMSO、六甲基磷酰胺、N-甲基吡咯烷酮、苯、环己酮、丁酮、环己酮、二氯苯、吡啶、乙酸、二氧六环、乙二醇单甲醚、1,2-二氯乙烷、乙醚、正辛烷。 一个好的溶剂在沸点附近对待结晶物质溶解度高而在低温下溶解度又很小。DMF、苯、二氧六环、环己烷在低温下接近凝固点，溶解能力很差，是理想溶剂。乙腈、氯苯、二甲苯、甲苯、丁酮、乙醇也是理想溶剂。 溶剂的沸点最好比被结晶物质的熔点低50℃。否则易产生溶质液化分层现象。溶剂的沸点越高，沸腾时溶解力越强，对于高熔点物质，最好选高沸点溶剂。 含有羟基、氨基而且熔点不太高的物质尽量不选择含氧溶剂。因为溶质与溶剂形成分子间氢键后很难析出。 含有氧、氮的物质尽量不选择醇做溶剂，原因同上。 溶质和溶剂极性不要相差太悬殊。水&gt;甲酸&gt;甲醇&gt;乙酸&gt;乙醇&gt;异丙醇&gt;乙腈&gt;DMSO&gt;DMF&gt;丙酮&gt;HMPA&gt;CH2Cl2&gt;吡啶&gt;氯仿&gt;氯苯&gt;THF&gt;二氧六环&gt;乙醚&gt;苯&gt;甲苯&gt;CCl4&gt;正辛烷&gt;环己烷&gt;石油醚 使用纯溶剂不适合时，可以采用混合溶剂法:用过量热的良溶剂溶解，加热，缓慢加入不良溶剂至有浑浊，静置冷却到析出固体。实验室常用的配伍是乙酸乙酯和石油醚。溶剂的筛选在试管中加入少量待结晶物，加入0.5mL根据上述规律所选择溶剂，加热沸腾几分钟，看溶质是否溶解。若溶解，用自来水冲试管外测，看是否有晶体析出。如果长时间加热仍有不溶物，可以静置试管片刻并用冷水冷却试管（勿摇动）。如果有物质在上层清液中析出，表示还可以增加一些溶解。若稍微浑浊，表示溶剂溶解度太小；若没有任何变化，说明不溶的固体是一种东西，已溶物质又非常易溶，不易析出。 重结晶常规操作 加热法：在锥形瓶或圆底烧瓶中加入溶质和一定溶剂, 装上球冷, 加热10分钟，若仍有不溶物, 继续从冷凝管上口补加溶剂至完全溶解再补加过量30％溶剂。滴加不良溶剂, 至出现混浊(必要的时候加入晶种)撤除加热, 自然冷却到室温（不要极速冷冻降温）或者更低温度，过滤得固体。 常温法：用可溶溶剂使固体正好溶解，再缓慢滴加不良溶剂, 至固体缓慢析出。 减少溶剂降温法：用低沸点溶剂（常用的是乙醚）使固体刚溶剂, 用水泵抽真空, 使溶剂缓慢减少, 同时温度会降低, 固体慢慢析出。 小Tips 溶剂的沸点最好比被结晶物质的熔点低50℃。否则易产生溶质液化分层现象。 含有羟基、氨基而且熔点不太高的物质尽量不选择含氧溶剂。因为溶质与溶剂形成分子间氢键后很难析出。 过柱预纯化，粗分离后再结晶，这样的话重结晶成功率会大大提高。 不要轻易冷冻，自然降温得到固体纯度会大大提高。 晶种的取得，用玻璃棒沾一滴溶液，挥干。","categories":[{"name":"化学","slug":"化学","permalink":"http://yoursite.com/categories/化学/"}],"tags":[{"name":"实验操作","slug":"实验操作","permalink":"http://yoursite.com/tags/实验操作/"}]},{"title":"萃取操作基础","slug":"18-1-20-CQ","date":"2018-01-19T20:18:26.000Z","updated":"2018-01-20T10:28:30.354Z","comments":true,"path":"2018/01/20/18-1-20-CQ/","link":"","permalink":"http://yoursite.com/2018/01/20/18-1-20-CQ/","excerpt":"","text":"原理利用物质在两种不互溶（或微溶）溶剂中溶解度或分配比的不同来达到分离提纯目的。 萃取溶剂的选择 萃取溶剂的选择，应根据被萃取化合物的溶解度而定，同时要易于和溶质分开，最好用低沸点溶剂。 一般难溶于水的物质用石油醚等萃取；较易溶者，用乙醚等萃取；易溶于水的物质用乙酸乙酯等萃取。 每次使用萃取溶剂的体积一般是被萃取液体的1/5～1/3，两者的总体 积不应超过分液漏斗总体积的2/3。 乳化和破乳在萃取时常常出现不分层和乳化的现象，可以通过以下几种情况进行解决： 长时间静置； 加入适当的物质，使其密度差增大，对于水相，通常加入无机盐； 因表面活性剂存在而形成的乳化，改变溶液的pH往往能使其分层； 因碱性而产生乳化，可加入少量酸破坏； 因少量悬浮固体引起的乳化，可将乳浊液缓慢过滤，过滤时在漏斗里铺上一层吸附剂(硅酸镁、氧化铝、硅胶)，则效果更好; 因两种溶剂（水与有机溶剂）能部分互溶而发生乳化，可加入少量电解质如氯化钠等，利用盐析作用加以破坏; 对于顽固的乳化，还可用离心分离，也可加热，或向有机溶剂中加入极性溶剂（如醇类或丙酮）以改变两相的表面张力。 几种特殊的有机萃取溶剂 溶剂 性质 正丁醇 不溶于水，具有小分子醇和大分子醇的共同特点。常用从水中萃取大极性物质 2-丁醇 适宜从缓冲液中提取水溶性物质 乙酸丁酯 性质介于小分子和大分子酯之间，在水中的溶解性极小，可从水中萃取有机化合物，尤其是氨基酸类化合物 异丙醚 性质介于小分子和大分子之间，极性相对较小，在水中的溶解度较小，很适宜从磷酸盐缓冲溶液中提取羧酸 在结束阶段进行盐洗（饱和NaCl溶液）此操作有利于干扰乳化，并且可以除去溶于有机相中的水，起到“干燥”有机层的作用。 干燥有机层将有机溶液和水相分离之后，在有机相中加入干燥剂以除去微量的水。通常用高效快速的MgSO4，但MgSO4有轻微的酸性；或用Na2SO4，它的干燥速度稍慢，效率较低，但Na2SO4为中性。这些化合物可以和残留在有机溶液中的水结合，作用后形成团块。加入的干燥剂要适量，只要有一些干燥剂不再结块，说明可以不用再加入干燥剂了。 在得到实验结果前，有机相、水相、不明固体一律不允许丢弃。在得到实验结果前，有机相、水相、不明固体一律不允许丢弃。在得到实验结果前，有机相、水相、不明固体一律不允许丢弃。 重要的事情说三遍！！！","categories":[{"name":"化学","slug":"化学","permalink":"http://yoursite.com/categories/化学/"}],"tags":[{"name":"实验操作","slug":"实验操作","permalink":"http://yoursite.com/tags/实验操作/"}]},{"title":"TLC薄层析基础","slug":"18-1-20-TLC","date":"2018-01-19T19:51:00.000Z","updated":"2018-01-20T10:22:08.575Z","comments":true,"path":"2018/01/20/18-1-20-TLC/","link":"","permalink":"http://yoursite.com/2018/01/20/18-1-20-TLC/","excerpt":"","text":"原理根据吸附剂对对样品中各组分吸附能力不同，及展开剂对它们的解吸附能力的不同，使各组分达到分离的目的。 反应液的取样 一般极性体系 强极性溶剂体系 需要淬灭的体系 强碱、酸性环境 可以直接取样，也可以稀释后取样 最好简单后处理（加水和有机溶剂萃取）以后取样 处理（如加水或酸和有机溶剂）后取样 最好中和后取样 TLC展开剂常用展开剂极性大小顺序：石油醚 &lt; 二氯甲烷 &lt; 乙醚 &lt; 四氢呋喃 &lt; 乙酸乙酯 &lt; 丙酮 &lt; 正丙醇 &lt; 甲醇 &lt; 水一般极性的化合物常用PE(石油醚)/EA(乙酸乙酯)体系极性较大的化合物常用DCM(二氯甲烷)/CH3OH体系另外常用的混合体系:PE / DCM，PE / Acetone，Ether / DCM，EA / DCM，EA / CH3OH 显色剂 一看、首先在日光下观察，划出有色物质的斑点位置 二照、在紫外灯下观察有无暗斑或荧光斑点 三碘、大部分有机物会吸附碘可逆的产生棕色或黄色斑点 四显、既无色又无紫外吸收的物质，可以用显色剂显色","categories":[{"name":"化学","slug":"化学","permalink":"http://yoursite.com/categories/化学/"}],"tags":[{"name":"实验操作","slug":"实验操作","permalink":"http://yoursite.com/tags/实验操作/"}]},{"title":"拓扑排序算法","slug":"18-1-16-topo","date":"2018-01-17T05:10:48.000Z","updated":"2018-01-17T05:10:56.402Z","comments":true,"path":"2018/01/17/18-1-16-topo/","link":"","permalink":"http://yoursite.com/2018/01/17/18-1-16-topo/","excerpt":"","text":"拓扑排序是一种将有向图中的顶点以线性方式进行排序。即对于任何连接自顶点u到顶点v的有向边uv，在最后的排序结果中，顶点u总是在顶点v的前面。比较经典的例子就是选课，在选择一门高年级课之前你需要先上过这门课的基础课程。比如你在上《高等有机化学》之前必须要先修过《基础有机化学》这门课。在图中的表达就是《基础有机化学》指向《高等有机化学》，指向谁就是要后修哪门课。 偏序和全序这两个是离散数学的概念（mmp我们不上这门课），偏序的意思就是对任意两点不管他们有没有先后关系，只要不存在矛盾关系即为偏序的意义。例如，A -&gt; B -&gt; C -&gt; A就不是偏序的。而全序是偏序的一种特殊情况，即为任意两个点要有明确的关系。例如 A -&gt; B -&gt; C -&gt; A和A -&gt; D -&gt; C -&gt; A其中 C 和 D 就没有明确的前后顺序，则不能说它是满足全序的，只是满足偏序的情况。对于一种排序算法，我们的评价指标之一就是它是否稳定，即相同的元素出现顺序有没有被改变。比如我们说快排是不稳定的排序，就是因为它无法判断相同值的元素的顺序。而比较稳定的排序，比如冒泡、插排等，它们在排序的时候，对于相同值的元素还会比较一个潜在的条件，也就是这个元素在队列中的位置。之所以要提到这两个概念，就是因为如果一个图的所有点都满足全序的条件，那么这个图的拓扑排序只会有一种结果。 算法实现以下是关于拓扑排序的一段伪代码：1234567891011121314151617S:初始图中入度为0的顶点的集合L:拓扑排序的结果while(S不为空)&#123; 从S中取出一个点n; 将n加入L; for (所有与n相连的点) &#123; 在m的入度中删除一条边; if (m的入度为0) 将m加入S; &#125;&#125;if (图中仍有边) return error; (证明其中存在至少一个环路)else return L; 拓扑排序和哈密顿路径对于一个DAG(Directed Acyclic Graph，有向无环图)，若其中的任意两点都存在可以直接确定的先后关系时，那么它的拓扑排序是唯一的，因为它们形成了全序的关系。图中是否存在哈密顿路径的关键在于确定图中的顶点是否存在全序的关系。因此只要设计一种算法遍历图中的所有点对，验证它们之间有确定的先后关系，那么我们就可以确定图中是有哈密顿路径的。但是这种算法效率太低，其原因就是没有用到传递性。以比较1,2,3三个整数为例，按照之前的思想，我们分别对(1,2)，(2,3)，(1,3)进行比较，这样需要三次比较，但是1和3的那次比较明显是多余的。为了能用上传递性的规则，我们可以先进行拓扑排序，然后再依次比较相邻的顶点是否具有一致的前后关系。若满足该条件，那么基本可以确定在这个图中是含有哈密顿路径的，反之则没有。 相关例题 HDOJ 5438","categories":[{"name":"计算机","slug":"计算机","permalink":"http://yoursite.com/categories/计算机/"},{"name":"原创","slug":"计算机/原创","permalink":"http://yoursite.com/categories/计算机/原创/"}],"tags":[{"name":"算法","slug":"算法","permalink":"http://yoursite.com/tags/算法/"},{"name":"模板","slug":"模板","permalink":"http://yoursite.com/tags/模板/"},{"name":"拓扑","slug":"拓扑","permalink":"http://yoursite.com/tags/拓扑/"}]},{"title":"后处理方法简单汇总","slug":"18-1-15-HCL","date":"2018-01-15T08:18:41.000Z","updated":"2018-01-16T07:27:11.080Z","comments":true,"path":"2018/01/15/18-1-15-HCL/","link":"","permalink":"http://yoursite.com/2018/01/15/18-1-15-HCL/","excerpt":"","text":"有机酸碱性化合物的分离提纯 具有酸碱性基团的有机化合物，可以得失质子形成离子化合物，而离子化合物与原来的母体化合物具有不同的物理化学性质。碱性化合物用有机酸或无机酸处理得到胺盐，酸性化合物用有机碱或无机碱处理得到钠盐或有机盐。根据有机化合物酸碱性的强弱，有机、无机酸碱一般为甲酸、乙酸、盐酸、硫酸、磷酸。碱为三乙胺、氢氧化钠、氢氧化钾、碳酸钠、碳酸氢钠等。在一般情况下，离子化合物在水中具有相当大的溶解性，而在有机溶剂中溶解度很小，同时活性碳只能够吸附非离子型的杂质和色素。利用以上的这些性质可对酸碱性有机化合物进行提纯。以上性质对所有酸碱性化合物并不通用，一般情况下，分子中酸碱性基团分子量所占整个分子的分子量比例越大，则离子化合物的水溶性就越大，分子中含有的水溶性基团例如羟基越多，则水溶性越大，因此，以上性质适用于小分子的酸碱化合物。对于大分子的化合物，则水溶性就明显降低。 酸碱性基团包括氨基。酸性基团包括：酰氨基、羧基、酚羟基、磺酰氨基、硫酚基、1，3－二羰基化合物等等。值得注意的是，氨基化合物一般为碱性基团，但是在连有强吸电子基团时就变为酸性化合物，例如酰氨基和磺酰氨基化合物，这类化合物在氢氧化钠、氢氧化钾等碱作用下就容易失去质子而形成钠盐。 中合吸附法：将酸碱性化合物转变为离子化合物，使其溶于水，用活性碳吸附杂质后过滤，则除去了不含酸碱性基团的杂质和机械杂质，再加酸碱中合回母体分子状态，这是回收和提纯酸碱性产品的方法。由于活性碳不吸附离子，故有活性碳吸附造成的产品损失忽劣不计。 中和萃取法：是工业过程和实验室中常见的方法，它利用酸碱性有机化合物生成离子时溶于水而母体分子状态溶于有机溶剂的特点，通过加入酸碱使母体化合物生成离子溶于水实现相的转移而用非水溶性的有机溶剂萃取非酸碱性杂质，使其溶于有机溶剂从而实现杂质与产物分离的方法。 成盐法：对于非水溶性的大分子有机离子化合物，可使有机酸碱性化合物在有机溶剂中成盐析出结晶来，而非成盐的杂质依然留在有机溶剂中，从而实现有机酸碱性化合物与非酸碱性杂质分离，酸碱性有机杂质的分离可通过将析出的结晶再重结晶，从而将酸碱性有机杂质分离。对于大分子的有机酸碱化合物的盐此时还可以采用水洗涤除去小分子的酸碱化合物已经成盐且具有水溶性的杂质。 对于水溶性的有机离子化合物，可在水中成盐后，将水用共沸蒸馏或直接蒸馏除去，残余物用有机溶剂充分洗涤几次，从而将杂质与产品分离。以上三种方法并不是孤立的，可根据化合物的性质和产品质量标准的要求，采用相结合的方法，尽量得到相当纯度的产品。 几种特殊的有机萃取溶剂 正丁醇：大多数的小分子醇是水溶性的，例如甲醇、乙醇、异丙醇、正丙醇等。大多数的高分子量醇是非水溶性的，而是亲脂性的能够溶于有机溶剂。但是中间的醇类溶剂例如正丁醇是一个很好的有机萃取溶剂。正丁醇本身不溶于水，同时又具有小分子醇和大分子醇的共同特点。它能够溶解一些能够用小分子醇溶解的极性化合物，而同时又不溶于水。利用这个性质可以采用正丁醇从水溶液中萃取极性的反应产物 丁酮：性质介于小分子酮和大分子酮之间。不像丙酮能够溶于水，丁酮不溶于水，可用来从水中萃取产物 乙酸丁酯：性质介于小分子和大分子酯之间，在水中的溶解度极小，不像乙酸乙酯在水中有一定的溶解度，可从水中萃取有机化合物，尤其是氨基酸的化合物，因此在抗生素工业中常用来萃取头孢、青霉素等大分子含氨基酸的化合物 异丙醚与特丁基叔丁基醚：性质介于小分子和大分子醚之间，两者的极性相对较小，类似于正己烷和石油醚，二者在水中的溶解度较小。可用于极性非常小的分子的结晶溶剂和萃取溶剂。也可用于极性较大的化合物的结晶和萃取溶剂。 做完反应后，应该首先采用萃取的方法，首先除去一部分杂质，这是利用杂质与产物在不同溶剂中的溶解度不同的性质 稀酸的水溶液洗去一部分碱性杂质。例如，反应物为碱性，而产物为中性，可用稀酸洗去碱性反应物。例如胺基化合物的酰化反应。 稀碱的水溶液洗去一部分酸性杂质。反应物为酸性，而产物为中性，可用稀碱洗去酸性反应物。例如羧基化合物的酯化反应。 用水洗去一部分水溶性杂质。例如，低级醇的酯化反应，可用水洗去水溶性的反应物醇。 如果产物要从水中结晶出来，且在水溶液中的溶解度又较大，可尝试加入氯化钠、氯化铵等无机盐，降低产物在水溶液中的溶解度－盐析的方法。 有时可用两种不互溶的有机溶剂作为萃取剂，例如反应在氯仿中进行，可用石油醚或正己烷作为萃取剂来除去一部分极性小的杂质，反过来可用氯仿萃取来除去极性大的杂质。 两种互溶的溶剂有时加入另外一种物质可变的互不相容，例如，在水作溶剂的情况下，反应完毕后，可往体系中加入无机盐氯化钠，氯化钾使水饱和，此时加入丙酮，乙醇，乙腈等溶剂可将产物从水中提取出来。 结晶与重结晶的方法 基本原理是利用相似相容原理。即极性强的化合物用极性溶剂重结晶，极性弱的化合物用非极性溶剂重结晶。对于较难结晶的化合物，例如油状物、胶状物等有时采用混合溶剂的方法，但是混合溶剂的搭配很有学问，有时只能根据经验。一般采用极性溶剂与非极性溶剂搭配，搭配的原则一般根据产物与杂质的极性大小来选择极性溶剂与非极性溶剂的比例。若产物极性较大，杂质极性较小则溶剂中极性溶剂的比例大于非极性溶剂的比例；若产物极性较小，杂质极性较大，则溶剂中非极性溶剂的比例大于极性溶剂的比例。较常用的搭配有：醇－石油醚，丙酮－石油醚，醇－正己烷，丙酮－正己烷等。但是如果产物很不纯或者杂质与产物的性质及其相近，得到纯化合物的代价就是多次的重结晶，有时经多次也提不纯。这时一般较难除去的杂质肯定与产物的性质与极性及其相近。除去杂质只能从反应上去考虑了。 水蒸气蒸馏、减压蒸馏与精馏的方法 这是提纯低熔点化合物的常用方法。一般情况下，减压蒸馏的回收率相应较低，这是因为随着产品的不断蒸出，产品的浓度逐渐降低，要保证产品的饱和蒸汽压等于外压，必须不断提高温度，以增加产品的饱和蒸汽压，显然，温度不可能无限提高，即产品的饱和蒸汽压不可能为零，也即产品不可能蒸净，必有一定量的产品留在蒸馏设备内被设备内的难挥发组分溶解，大量的斧残既是证明。 共沸蒸馏不仅适用于产品分离过程，也适用于反应物系的脱水、溶剂的脱水、产品的脱水等。它比分子筛、无机盐脱水工艺具有设备简单、操作容易、不消耗其它原材料等优点。例如：在生产氨噻肟酸时，由于分子中存在几个极性的基团氨基、羧基等，它们能够和水、醇等分子形成氢键，使氨噻肟酸中存在大量的游离及氢键的水，如采用一般的真空干燥等干燥方法，不仅费时，也容易造成产物的分解，这时可采用共沸蒸馏的方法将水分子除去，具体的操作为将氨噻肟酸与甲醇在回流下搅拌几小时，可将水分子除去，而得到无水氨噻肟酸。又比如，当分子中存在游离的或氢键的甲醇时，可用另外一种溶剂，例如正己烷、石油醚等等，进行回流，可除去甲醇。可见共沸蒸馏在有机合成的分离过程中占有重要的地位。 超分子的方法，利用分子的识别性来提纯产物 脱色的方法 一般采用活性炭、硅胶、氧化铝等。活性炭吸附非极性的化合物与小分子的化合物，硅胶与氧化铝吸附极性强的与大分子的化合物，例如焦油等。对于极性杂质与非极性杂质同时存在的物系，应将两者同时结合起来。比较难脱色的物系，一般用硅胶和氧化铝就能脱去。对于酸碱性化合物的脱色，有时比较难，当将酸性化合物用碱中和形成离子化合物而溶于水中进行脱色时，除了在弱碱性条件下脱色一次除去碱性杂质外，还应将物系逐渐中和至弱酸性，再脱色一次除去酸性杂质，这样就将色素能够完全脱去。同样当将碱性化合物用酸中和至弱碱性溶于水进行脱色时，除了在弱酸性条件下脱色一次除去酸性杂质外，还应将物系逐渐中和至弱碱性，再脱色一次除去碱性杂质。","categories":[{"name":"化学","slug":"化学","permalink":"http://yoursite.com/categories/化学/"}],"tags":[{"name":"后处理","slug":"后处理","permalink":"http://yoursite.com/tags/后处理/"},{"name":"实验操作","slug":"实验操作","permalink":"http://yoursite.com/tags/实验操作/"}]},{"title":"BST(二叉搜索树)","slug":"18-1-15-BST","date":"2018-01-15T05:09:54.000Z","updated":"2018-01-16T03:08:18.625Z","comments":true,"path":"2018/01/15/18-1-15-BST/","link":"","permalink":"http://yoursite.com/2018/01/15/18-1-15-BST/","excerpt":"","text":"二叉搜索树是一种树的类型。它的左子树若不为空，则其中所有节点的值都必定小于父节点；同理若它的右子树不为空，其中所有的节点也必定大于父节点。如下所示，12的左子树的节点数值全部比12小，右子树节点的数值全部比12大。 构造二叉搜索树针对于构造二叉搜索树，先确定其根节点，后进行如下操作 比较节点(root)与待插入值的大小：若root较大，则将root赋值为该节点的左子节点；若root较小，则将root赋值为该节点的右子节点。 若该节点没有的左(右)子节点为0，也就是没有子节点。那么将此待插入值定义为root的子节点。 搜索二叉搜索树因为二叉搜索树一定满足上面提到的条件，故而在搜索时应先比较大小，若小于当前节点则向它的左子树去搜索，若大于当前节点则向它的右子树去搜索，直到当前节点等于我们要找的节点。 相关题目HDOJ 5444","categories":[{"name":"计算机","slug":"计算机","permalink":"http://yoursite.com/categories/计算机/"},{"name":"原创","slug":"计算机/原创","permalink":"http://yoursite.com/categories/计算机/原创/"}],"tags":[{"name":"算法","slug":"算法","permalink":"http://yoursite.com/tags/算法/"},{"name":"树","slug":"树","permalink":"http://yoursite.com/tags/树/"},{"name":"模板","slug":"模板","permalink":"http://yoursite.com/tags/模板/"}]},{"title":"Hello World","slug":"hello-world","date":"2018-01-15T02:18:16.970Z","updated":"2018-01-15T06:49:11.099Z","comments":true,"path":"2018/01/15/hello-world/","link":"","permalink":"http://yoursite.com/2018/01/15/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}